app/controllers/webpages_controller.rb

  def index
    @webpages = Webpage.all
---
SELECT * FROM "webpages"

  def show
    @webpage = Webpage.find(params[:id])
---
SELECT * FROM "webpages" WHERE ("webpages"."id" = 1)

  def edit
    @webpage = Webpage.find(params[:id])
---
SELECT * FROM "webpages" WHERE ("webpages"."id" = 1)

  def create

    @webpage = Webpage.new(params[:webpage])
    http_connector = HTTPConnector.new(@webpage.url)
    http_connector.errors.each {|error| @webpage.errors.add(:url, error)} if http_connector.errors.any?
    @webpage.response = http_connector.response.body unless http_connector.errors.any?


    respond_to do |format|
      if http_connector.errors.empty? && @webpage.save
---
SELECT "webpages".id FROM "webpages" WHERE ("webpages"."url" = 'Test') LIMIT 1
SELECT count(*) AS count_all FROM "webpages"
INSERT INTO "webpages" ("created_at", "response", "updated_at", "url") VALUES('2012-10-19 00:56:41', '<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html lang="en" xml:lang="en" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="text/html; charset=utf-8" http-equiv="content-type" /><script type="text/javascript">//<![CDATA[

  def destroy
    @webpage = Webpage.find(params[:id])
    @webpage.destroy
---
SELECT * FROM "webpages" WHERE ("webpages"."id" = 2)
DELETE FROM "webpages" WHERE "id" = 2